all/.local/bin/snap-apply-manifest
#!/usr/bin/env bash
# snap-apply-manifest
# Install missing, optionally remove extras that are not in the manifest.
# Flags: REMOVE_EXTRA=1 to enforce, FORCE_PROTECTED=1 to allow bases/platforms removal if Snap permits.


# [[file:../../../snap.org::*snap-apply-manifest][snap-apply-manifest:1]]
set -Eeuo pipefail

# Defaults (can be overridden by env or flags)
REMOVE_EXTRA="${REMOVE_EXTRA:-0}"
FORCE_PROTECTED="${FORCE_PROTECTED:-0}"
MODE="apply"   # apply|dry

# Parse flags first, then optional manifest path
while (($#)); do
  case "$1" in
    --dry|-n) MODE="dry" ;;
    --yes|-y) MODE="apply" ;;
    --remove-extra) REMOVE_EXTRA=1 ;;
    --force-protected) FORCE_PROTECTED=1 ;;
    --) shift; break ;;
    -h|--help)
      cat <<'EOF'
Usage: snap-apply-manifest [options] [MANIFEST.ssv]

Options:
  -n, --dry             Dry run (no changes)
  -y, --yes             Apply changes (default)
      --remove-extra    Uninstall snaps not listed in manifest
      --force-protected Also attempt protected removals (bases/platforms)
      --                End of options
EOF
      exit 0 ;;
    *) break ;;
  esac
  shift
done

mf="${1:-$HOME/.dotfiles/all/.snap/manifest/apps.ssv}"

run() {
  if [[ "$MODE" == "dry" ]]; then
    echo "(dry) $*"
  else
    echo "+ $*"
    eval "$@"
  fi
}

read_manifest() {
  # Accept TABs or any number of SPACEs; ignore blank lines and comments.
  # Output is normalized to real TABs for downstream reads.
  awk 'BEGIN{FS="[[:space:]]+"; IGNORECASE=1}
       /^[[:space:]]*($|#)/ {next}
       {
         name=$1; ch=$2; cl=$3;
         if (ch=="") ch="latest/stable";
         if (tolower(cl)=="yes" || tolower(cl)=="true") cl="--classic"; else cl="";
         printf "%s %s %s\n", name, ch, cl
       }' "$mf"
}

echo "== Apply installs =="
read_manifest | while read -r name channel classic; do
  # Preflight: warn if snap name does not exist in store
  if ! snap info "$name" >/dev/null 2>&1; then
    echo "skip: '$name' not found in Snap store (remove or correct in manifest)"; continue
  fi
  if snap list | awk 'NR>1{print $1}' | grep -qx "$name"; then
    run sudo snap refresh "$name" --channel="$channel"
  else
    if [[ -n "$classic" ]]; then
      run sudo snap install "$name" --channel="$channel" --classic
    else
      run sudo snap install "$name" --channel="$channel"
    fi
  fi
done

if [[ "$REMOVE_EXTRA" -eq 1 ]]; then
  echo "== Enforce removals (extras not in manifest) =="
  protect='^(bare|core|core18|core20|core22|core24|snapd|gtk-common-themes|gnome-3-28-1804|gnome-42-2204|canonical-livepatch)$'
  want="$(read_manifest | cut -f1 | sort -u)"
  installed="$(snap list | awk 'NR>1{print $1}' | sort -u)"
  extras="$(comm -23 <(echo "$installed") <(echo "$want"))"
  while read -r name; do
    [[ -z "$name" ]] && continue
    if [[ "$name" =~ $protect && "$FORCE_PROTECTED" -ne 1 ]]; then
      echo "keep: $name is protected"
      continue
    fi
    run sudo snap remove --purge "$name" || true
  done <<< "$extras"
else
  echo "== Removals skipped, set --remove-extra to enforce =="
fi

echo "Done. Mode=${MODE}"
# snap-apply-manifest:1 ends here
