all/.local/bin/snap-autoremove
#!/usr/bin/env bash
# snap-autoremove

# [[file:../../../snap.org::*snap-autoremove][snap-autoremove:1]]
set -Eeuo pipefail

MODE="dry" PURGE_DATA=0
APPS_TO_REMOVE=()

while (($#)); do
  case "$1" in
    -n|--dry|--dry-run) MODE="dry" ;;
    -y|--yes)           MODE="yes" ;;
    --purge-data)       PURGE_DATA=1 ;;
    --remove)           shift; APPS_TO_REMOVE+=("$@"); break ;;
    -h|--help)
      cat <<'EOF'
Usage: snap-autoremove [--dry-run|-n] [--yes|-y] [--purge-data] [--remove <apps...>]

Steps:
  1) Remove disabled revisions.
  2) Remove specified app snaps (if any).
  3) Remove unused content/platform snaps.
  4) Attempt to remove unused bases (kept if in use).
  5) Optionally purge orphaned data dirs (~/snap and /var/snap).

Dry run by default. Use --yes to execute.
EOF
      exit 0;;
    *) echo "Unknown arg: $1" >&2; exit 2;;
  esac
  shift
done

run() { if [[ "$MODE" == "yes" ]]; then echo "+ $*"; eval "$@"; else echo "(dry) $*"; fi; }

try_remove_base() {
  local b="$1"
  if [[ "$MODE" == "yes" ]]; then
    # Capture stderr and status to print a friendly keep: line
    if out_err=$(sudo snap remove "$b" 2>&1); then
      echo "$b removed"
    else
      # Trim newlines
      local oneline; oneline=$(tr '\n' ' ' <<<"$out_err" | sed 's/  */ /g')
      echo "keep: $b is in use ($oneline)"
    fi
  else
    echo "(dry) sudo snap remove '$b'"
  fi
}

echo "== 1) Prune disabled revisions =="
found=0
while read -r name rev status; do
  [[ "$status" == "disabled" ]] || continue
  found=1
  run "sudo snap remove '$name' --revision='$rev'"
done < <(snap list --all | awk 'NR>1 {print $1, $3, $5}')
[[ "$found" -eq 0 ]] && echo "(none) No disabled revisions to prune."

if ((${#APPS_TO_REMOVE[@]})); then
  echo "== 2) Remove requested apps =="
  for app in "${APPS_TO_REMOVE[@]}"; do
    if snap list | awk 'NR>1 {print $1}' | grep -qx "$app"; then
      run "sudo snap remove --purge '$app'"
    else
      echo "skip: $app not installed"
    fi
  done
fi

echo "== 3) Remove unused content/platform snaps =="
CANDIDATES=(gtk-common-themes gtk2-common-themes gnome-3-28-1804 gnome-42-2204)
for s in "${CANDIDATES[@]}"; do
  if snap list | awk 'NR>1{print $1}' | grep -qx "$s"; then
    consumers=$(snap connections "$s" | awk -v prov="^"${s//./\\.}":" '
      NR>1 && $3 ~ prov && $2 != "-" {print $2}' | sort -u | wc -l)
    if [[ "$consumers" -eq 0 ]]; then
      run "sudo snap remove '$s'"
    else
      echo "keep: $s has $consumers consumer(s)"
    fi
  fi
done

echo "== 4) Attempt to remove unused bases =="
for b in bare core core18 core20 core22 core24; do
  if snap list | awk 'NR>1{print $1}' | grep -qx "$b"; then
    try_remove_base "$b"
  fi
done

if ((PURGE_DATA)); then
  echo "== 5) Purge orphaned data dirs =="
  installed="$(snap list | awk 'NR>1{print $1}' | sort -u)"
  if [[ -d "$HOME/snap" ]]; then
    while read -r dir; do
      app="${dir##*/}"
      if ! grep -qx "$app" <<<"$installed"; then
        run "rm -rf '$dir'"
      fi
    done < <(find "$HOME/snap" -mindepth 1 -maxdepth 1 -type d)
  fi
  if [[ -d /var/snap ]]; then
    while read -r dir; do
      app="${dir##*/}"
      if ! grep -qx "$app" <<<"$installed"; then
        run "sudo rm -rf '$dir'"
      fi
    done < <(find /var/snap -mindepth 1 -maxdepth 1 -type d)
  fi
fi

echo "Done. Mode: ${MODE:-dry}"
# snap-autoremove:1 ends here
