all/.local/bin/snap-capture
#!/usr/bin/env bash
# snap-capture
# Export current non-base apps into SSV format you can curate.

# [[file:../../../snap.org::*snap-capture][snap-capture:1]]
set -Eeuo pipefail
out="${1:-$HOME/DotCortex/all/.snap/manifest/apps.ssv}"
tmp="$(mktemp)"
# Skip core bases and common platforms
protect='^(bare|core|core18|core20|core22|core24|snapd|gtk-common-themes|gnome-3-28-1804|gnome-42-2204|canonical-livepatch)$'
{
  echo "# name channel classic"
  snap list | awk 'NR>1 {print $1, $4}' | while read -r name tracking; do
    [[ "$name" =~ $protect ]] && continue
    classic="no"
    # Best effort: detect classic from snap info
    if snap info "$name" 2>/dev/null | awk '/confinement:/{print $2}' | grep -qx classic; then
      classic="yes"
    fi
    printf "%s %s %s\n" "$name" "$tracking" "$classic"
  done
} > "$tmp"
mkdir -p "$(dirname "$out")"
mv "$tmp" "$out"
echo "Captured to $out"
# snap-capture:1 ends here
