all/.local/bin/snap-diff
#!/usr/bin/env bash
# snap-diff
# Show plan: desired vs installed, and who would be removed.


# [[file:../../../snap.org::*snap-diff][snap-diff:1]]
set -Eeuo pipefail
mf="${1:-$HOME/DotCortex/all/.snap/manifest/apps.ssv}"

# Accept spaces or tabs; ignore comments/blank lines
want_names="$(
  awk 'BEGIN{FS="[ \t]+"; IGNORECASE=1}
       /^[ \t]*($|#)/ {next}
       NF>=1 {print $1}' "$mf" 2>/dev/null | sort -u || true
)"

installed="$(snap list | awk 'NR>1{print $1}' | sort -u)"
protect='^(bare|core|core18|core20|core22|core24|snapd|gtk-common-themes|gnome-3-28-1804|gnome-42-2204|canonical-livepatch)$'

echo "== To install =="
comm -13 <(echo "$installed") <(echo "$want_names") || true

echo "== Extra installed (candidates to remove) =="
comm -23 <(echo "$installed") <(echo "$want_names") | grep -Ev "$protect" || true

echo "== Protected installed (not removed unless forced) =="
comm -23 <(echo "$installed") <(echo "$want_names") | grep -E "$protect" || true
# snap-diff:1 ends here
