all/.local/bin/snap-prune-disabled
#!/usr/bin/env bash
# snap-prune-disabled
# Small focused helper if you want the classic one-liner, wired through Make and Loom.


# [[file:../../../snap.org::*snap-prune-disabled][snap-prune-disabled:1]]
set -Eeuo pipefail

found=0
echo "== Pruning disabled snap revisions =="
while read -r name rev status; do
  [[ "$status" == "disabled" ]] || continue
  found=1
  echo "+ sudo snap remove '$name' --revision='$rev'"
  sudo snap remove "$name" --revision="$rev"
done < <(snap list --all | awk 'NR>1 {print $1, $3, $5}')

if [[ "$found" -eq 0 ]]; then
  echo "(none) No disabled revisions to prune."
fi
# snap-prune-disabled:1 ends here
